def menu():
    print('***********************************************')
    print('*'+'1'+')查看文件库中普通文件'+'*')
    print('*'+'2'+')下载文件库文件到本地'+'*')
    print('*'+'3'+')上传文件到文件库'+'*')
    print('*'+'4'+')退出'+'*')
    print('***********************************************')


 menu()
            x = input("请输入您需要操作什么:")
            if x == 1:
                #查看所有普通文件
                #调用方法
                pass
            elif x == 2:
                #下载文件到本地
                #调用方法
                pass
            elif x == 3:
                #上传文件
                #调用方法
                pass
            elif x == 4:
                #退出
                pass